DataProcessors/ОтсутствиеСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>ОтсутствиеСотрудников</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/КадрыОтсутствие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>КадрыОтсутствие</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Сотрудники</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатусОтсутствия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПослеОтсутствия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Факт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполненыПосещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудник</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяСтавка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеСтавки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ОтсутствиеСотрудников/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьОтсутствияПоДокументам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КадрыОтсутствиеСотрудник.Подразделение,
		|	КадрыОтсутствиеСотрудник.Должность,
		|	КадрыОтсутствиеСотрудник.ТарифнаяСтавка,
		|	КадрыОтсутствиеСотрудник.Ссылка.ДатаНачала,
		|	КадрыОтсутствиеСотрудник.Ссылка.ДатаОкончания,
		|	КадрыОтсутствиеСотрудник.Ссылка.Факт,
		|	КадрыОтсутствиеСотрудник.Ссылка.Проведен,
		|	КадрыОтсутствиеСотрудник.Ссылка.СтатусОтсутствия,
		|	КадрыОтсутствиеСотрудник.Ссылка.СтатусОтсутствия.Цвет КАК Цвет,
		|	КадрыОтсутствиеСотрудник.Ссылка.ФизическоеЛицо,
		|	КадрыОтсутствиеСотрудник.Ссылка
		|ИЗ
		|	Документ.КадрыОтсутствие.Сотрудник КАК КадрыОтсутствиеСотрудник
		|ГДЕ
		|	КадрыОтсутствиеСотрудник.Подразделение = &Подразделение
		|	И НЕ КадрыОтсутствиеСотрудник.Ссылка.ПометкаУдаления
		|	И КадрыОтсутствиеСотрудник.Ссылка.ДатаНачала <= &ДатаОкончания
		|	И КадрыОтсутствиеСотрудник.Ссылка.ДатаОкончания >= &ДатаНачала
		|
		|СГРУППИРОВАТЬ ПО
		|	КадрыОтсутствиеСотрудник.Должность,
		|	КадрыОтсутствиеСотрудник.Подразделение,
		|	КадрыОтсутствиеСотрудник.ТарифнаяСтавка,
		|	КадрыОтсутствиеСотрудник.Ссылка.ДатаНачала,
		|	КадрыОтсутствиеСотрудник.Ссылка.ДатаОкончания,
		|	КадрыОтсутствиеСотрудник.Ссылка.Факт,
		|	КадрыОтсутствиеСотрудник.Ссылка.Проведен,
		|	КадрыОтсутствиеСотрудник.Ссылка.СтатусОтсутствия,
		|	КадрыОтсутствиеСотрудник.Ссылка.СтатусОтсутствия.Цвет,
		|	КадрыОтсутствиеСотрудник.Ссылка.ФизическоеЛицо,
		|	КадрыОтсутствиеСотрудник.Ссылка";
	
	Запрос.УстановитьПараметр("ДатаНачала", 	ПериодОтчета.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 	ПериодОтчета.ДатаОкончания);
	Запрос.УстановитьПараметр("Подразделение", 	Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	// передаем структуру
	сОтсутствия = НОвый Структура;
	// состав структуры - массивы
	мСерии 		= Новый Массив;
	мДолжности 	= Новый Массив;
	
	мОтсутствия = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Цвет	= УП_РаботаСРабочимКалендаремСервер.ПолучитьЦветТабличногоДокумента( ВыборкаДетальныеЗаписи.Цвет);
		
		Если мСерии.Найти(ВыборкаДетальныеЗаписи.СтатусОтсутствия ) = Неопределено Тогда
			сСерия = Новый Структура;
			сСерия.Вставить("Значение", 		ВыборкаДетальныеЗаписи.СтатусОтсутствия );

			сСерия.Вставить("Цвет", 			Цвет );
			сСерия.Вставить("Текст", 			ВыборкаДетальныеЗаписи.СтатусОтсутствия );
			//сСерия.Вставить("ПриоритетЦвета", 	Ложь );
			
			мСерии.Добавить(сСерия);
		КонецЕсли;
		Если мДолжности.Найти( ВыборкаДетальныеЗаписи.Должность ) = Неопределено Тогда
			мДолжности.Добавить(ВыборкаДетальныеЗаписи.Должность);
		КОнецЕсли;
		
		
		сОт = Новый Структура("Ссылка,Должность,ТарифнаяСтавка,СтатусОтсутствия,ФизическоеЛицо,Факт,ДатаНачала,ДатаОкончания,Цвет");
		ЗаполнитьЗначенияСвойств( сОт, ВыборкаДетальныеЗаписи,,"Цвет" );
		Если ВыборкаДетальныеЗаписи.Факт Тогда
			сОт.Цвет = WebЦвета.ЦианТемный;
		Иначе
			сОт.Цвет = Цвет;
		КонецЕсли;
		
		// 
		мОтсутствия.Добавить( сОт );
		
	КонецЦикла;
	сОтсутствия.Вставить("Серии", мСерии );
	сОтсутствия.Вставить("Должности", мДолжности );
	сОтсутствия.Вставить("Точки", мОтсутствия );
	Возврат сОтсутствия;
	
КонецФункции

&НаСервере
Процедура СформироватьДиаграммуПоОтпускамСотрудников( ОтсутствиеДГ )
	сОтсутствия = ПолучитьОтсутствияПоДокументам();
	Серия				= ОтсутствиеДГ.Серии.Добавить();
	
	Для Каждого Отсутствие ИЗ сОтсутствия.Точки Цикл
		ТочкаДолжность		= ОтсутствиеДГ.УстановитьТочку( Отсутствие.Должность  );
		//
		//Цвет				= УП_РаботаСРабочимКалендаремСервер.ПолучитьЦветТабличногоДокумента( Отсутствие.Цвет);;
		
		// само отстутствие
		Точка				= ОтсутствиеДГ.УстановитьТочку( Отсутствие.ФизическоеЛицо, Отсутствие.Должность );
		Точка.Текст 		= Отсутствие.ФизическоеЛицо;
		ЗначениеДГ  		= ОтсутствиеДГ.ПолучитьЗначение( Точка, Серия );
		//
		Интервал 			= ДобавитьИнтервал( ЗначениеДГ, 
								Отсутствие.Ссылка,
								НачалоДня(Отсутствие.ДатаНачала), 
								КонецДня(Отсутствие.ДатаОкончания), 
								Отсутствие.Цвет,
								Отсутствие.СтатусОтсутствия);   
								
	КонецЦикла;
	
	// отрисовываем выходные дни
	ОтсутствиеДГ.ИнтервалыФона.Очистить();
	ДниСхемыРабот = МассивНеРабочихДней( ОтсутствиеДГ.НачалоПолногоИнтервала,  ОтсутствиеДГ.КонецПолногоИнтервала);
	Для Каждого День ИЗ ДниСхемыРабот Цикл
		Выходной = ОтсутствиеДГ.ИнтервалыФона.Добавить(НачалоДня(День), КонецДня(День));
		// 
		Выходной.Цвет = WebЦвета.СветлоСерый;
		
	КонецЦикла;
		
	
КонецПроцедуры

&НаСервере
Функция ДобавитьИнтервал( ЗначениеДГ, Значение, Начало, Конец, Цвет, Статус )
	Интервал = ЗначениеДГ.Добавить();
	Интервал.Начало 		= Начало;
	Интервал.Конец  		= Конец;
	Интервал.Расшифровка 	= Значение;
	Интервал.Цвет			= Цвет;
	// срок отсутствия
	Интервал.Текст			= "" + Статус + ", " + Формат(Начало,"ДЛФ=D" ) + "-" + Формат(Конец, "ДЛФ=D");
	Возврат Интервал;
КонецФункции


&НаСервереБезКонтекста
Функция МассивНеРабочихДней( НачалоПолногоИнтервала, КонецПолногоИнтервала )
	Возврат УП_РаботыСервер.МассивНеРабочихДней( НачалоПолногоИнтервала, КонецПолногоИнтервала );
КонецФункции

&НаСервере
Процедура НастройкаДиаграммыГанта( ДиаграммаГанта )
	ДиаграммаГанта.Очистить();
	ДиаграммаГанта.ОтображатьЗаголовок 				= Ложь;
	ДиаграммаГанта.АвтоОпределениеПолногоИнтервала 	= Ложь;
	
	ДиаграммаГанта.УстановитьПолныйИнтервал(ПериодОтчета.ДатаНачала, ПериодОтчета.ДатаОкончания);

	//
	ДиаграммаГанта.ЕдиницаПериодическогоВарианта 	= ТипЕдиницыШкалыВремени.Месяц;
	ДиаграммаГанта.КратностьПериодическогоВарианта	= 1;
	
	// две шкалы времени - день и месяц
	Если ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы.Количество() = 1 Тогда
		ШкалаМесяц 				= ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
		ШкалаМесяц.Единица   	= ТипЕдиницыШкалыВремени.Месяц;
		ШкалаМесяц.Кратность 	= 1;
		ШкалаМесяц.ФорматДня	= ФорматДняШкалыВремени.ДеньМесяца;
		
		// чтобы была верхней
		ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы.Сдвинуть( ШкалаМесяц, -1);
	КонецЕсли;	
	
	//
	ДиаграммаГанта.ПоддержкаМасштаба			= ПоддержкаМасштабаДиаграммыГанта.Авто;
	ДиаграммаГанта.ОтображениеИнтервала			= ОтображениеИнтервалаДиаграммыГанта.Плоский;
	ДиаграммаГанта.ОтображениеТекстаЗначения 	= ОтображениеТекстаЗначенияДиаграммыГанта.Право;
	ДиаграммаГанта.ОтображатьЛегенду			= Ложь;
	ДиаграммаГанта.ОбластьПостроения.Право		= 1;
	
	
КонецПроцедуры


&НаКлиенте
Процедура Сформировать(Команда)
	НастройкаДиаграммыГанта( ОтсутствиеДГ );
	
	СформироватьДиаграммуПоОтпускамСотрудников( ОтсутствиеДГ );
	ОтсутствиеДГ.ПоказатьУровеньТочек(0);
	ОтсутствиеДГ.Обновление 						= Истина;
	
	
КонецПроцедуры

&НаСервере
Функция ПериодОтчетаСтрокой()
	Возврат ПредставлениеПериода( ПериодОтчета.ДатаНачала, ПериодОтчета.ДатаОкончания, " ФП = Истина ");
КонецФункции

&НаСервере
Процедура  ПодготовитьДиаграммуДляПечати( ВыводимыйДокумент );
	Макет 		= РеквизитФормыВЗначение("Объект").ПолучитьМакет("ДиаграммаГанта");
	
	Область = Макет.ПолучитьОбласть( "Заголовок" );
	Область.Параметры.ПечПериод 	= ПериодОтчетаСтрокой();
	Область.Параметры.Подразделение = Подразделение;
	ВыводимыйДокумент.Вывести(Область);
	
	Область		= Макет.ПолучитьОбласть("ДиаграммаОтсутствия");//"ОбластьДиаграммы");
	ВыводимыйДокумент.Вывести( Область );
	
	ТекущаяДиаграмма 			= ВыводимыйДокумент.Рисунки[0].Объект;
	НастройкаДиаграммыГанта( ТекущаяДиаграмма );
	
	// изменяем настройкм
	//ТекущаяДиаграмма = Новый ДиаграммаГанта;
	ТекущаяДиаграмма.ОтображатьПустыеЗначения = Ложь;
	ТекущаяДиаграмма.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.ВсеДанные;
	ТекущаяДиаграмма.Обновление = Ложь;
	
	//
	СформироватьДиаграммуПоОтпускамСотрудников( ТекущаяДиаграмма );	
	//
	ТекущаяДиаграмма.ПоказатьУровеньТочек();
	
КонецПроцедуры


&НаКлиенте
Процедура Печать(Команда)
	ВыводимыйДокумент = Новый ТабличныйДокумент;
	
	ПодготовитьДиаграммуДляПечати( ВыводимыйДокумент );
	//
	ВыводимыйДокумент.АвтоМасштаб = Истина;
	ВыводимыйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Заголовок = "Отсутствие сотрудников " + ПериодОтчетаСтрокой();
	ВыводимыйДокумент.Показать(Заголовок);;

	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодОтчета()
	Если НЕ ЗначениеЗаполнено( ПериодОтчета.ДатаНачала ) Тогда
		ПериодОтчета.ДатаНачала = НачалоКвартала( ТекущаяДата());
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено( ПериодОтчета.ДатаОкончания ) Тогда 
		ПериодОтчета.ДатаОкончания = КонецКвартала(ТекущаяДата());
	КОнецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПериодОтчета();
	НастройкаДиаграммыГанта( ОтсутствиеДГ );
КонецПроцедуры
